Computer Science/Leetcode/Subjects/bit_manipulation/bit_manipulation.tex
% Created 2019-08-13 Tue 13:37
% Intended LaTeX compiler: pdflatex
\documentclass[12pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage[margin=1in] {geometry}
\usepackage{parskip}
\setlength\parindent{0pt}
\linespread {1.0}
\setcounter{tocdepth} {3}
\setcounter{secnumdepth} {3}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.2 (Org mode 9.2.3)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Bit Manipulation}
\label{sec:org5eab500}
\href{https://leetcode.com/problems/sum-of-two-integers/discuss/84278/A-summary:-how-to-use-bit-manipulation-to-solve-problems-easily-and-efficiently}{Reference}
\subsection{Introduction}
\label{sec:orgdddf8e5}
Bit manipulation is the act of algorithmically manipulating bits or other pieces of data shorter than a word. Computer programming tasks that require bit manipulation include low-level device control, error detection and correction algorithms, data compression, encryption algorithms, and optimization. For most other tasks, modern programming languages allow the programmer to work directly with abstractions instead of bits that represent those abstractions. Source code that does bit manipulation makes use of the bitwise operations: AND, OR, XOR, NOT, and bit shifts.

Bit manipulation, in some cases, can obviate or reduce the need to loop over a data structure and can give many-fold speed ups, as bit manipulations are processed in parallel, but the code can become more difficult to write and maintain.
\subsection{Basics}
\label{sec:org31494ac}
At the heart of bit manipulation are the bit-wise operators:
\begin{itemize}
\item \texttt{\&}: AND
\item \texttt{|}: OR
\item \texttt{\textasciitilde{}}: NOT
\item \texttt{\textasciicircum{}}: XOR (exclusive OR), equivalent to adding two bits and discarding the carry. XOR is its own inverse, this means for a given number \texttt{num}, \texttt{num \textasciicircum{} num == 0}. Also, \texttt{num \textasciicircum{} 0} is \texttt{num} itself.
\item \texttt{<<}: left shift
\item \texttt{>>}: right shift
\end{itemize}

There is no boolean operator counterpart to bitwise exclusive-OR, but there is a simple explanation. The exclusive-OR operation takes two inputs and returns a 1 if either one or the other of the inputs is a 1, but not if both are. That is, if both inputs are 1 or both inputs are 0, it returns 0. Bitwise exclusive-OR, with the operator of a caret, \texttt{\textasciicircum{}}, performs the exclusive-OR operation on each pair of bits. Exclusive-OR is commonly abbreviated XOR.

Some other manipulations are (\texttt{A} and \texttt{B} are two integers):
\begin{itemize}
\item set union: \texttt{A | B}
\item set intersection: \texttt{A \& B}
\item set substraction: \texttt{A \& \textasciitilde{}B}
\item set negation:
\begin{itemize}
\item \texttt{ALL\_ONE\_BITS \textasciicircum{} A}
\item \texttt{\textasciitilde{}A}: pay attention that this is not A -> -A, to make A -> -A, you do: \texttt{\textasciitilde{}(A - 1)}.
\end{itemize}
\item set bit: \texttt{A |= 1 << bit}: set the bit with a position of \texttt{bit} as 1 (from right to left)
\item clear bit: \texttt{A \&= \textasciitilde{}(1 << bit)}: set the bit with a position of \texttt{bit} as 0 (from right to left)
\item test bit: \texttt{(A \& 1 << bit) != 0}: test the bit with a position of \texttt{bit} to see if it is 1 or 0
\item extract last bit: get the significance of the last 1-bit (its position), keeping all zeros from the last bit to rightmost zero.
\begin{itemize}
\item \texttt{A \& -A}
\item \texttt{A \& \textasciitilde{}(A - 1)}
\item \texttt{A \textasciicircum{} (A \& (A - 1))}: you first remove the last bit, then XOR with the original number, you'll only keep the last bit since it is the only place where two numbers different.
\end{itemize}
\item remove last bit: \texttt{A \& ( A - 1)}
\item get \texttt{ALL\_ONE\_BITS}: \texttt{\textasciitilde{}0}
\end{itemize}
\subsection{Examples}
\label{sec:orgd6ca303}
\subsubsection{Count the number of one bit (practice \texttt{\&, <<})}
\label{sec:org579cf2c}
Count the number of ones in the binary representation of the given number. The strategy is to count the rightmost one in its binary representation and remove it, until you remove all the ones in its binary representation.

To remove the rightmost one in a number's binary representation, you do: \texttt{n \& (n - 1)}.

Take a closer look on \texttt{(n - 1)}. What it does is actually transform all zeros from rightmost one to the right end to 1, and transform the rightmost one to zero. See below examples:
\begin{verbatim}
eg. 1.
1024: 0100 0000 0000
1023: 0011 1111 1111

eg. 2.
44: 0010 1100
43: 0010 1011
\end{verbatim}
Pay attention that from rightmost one to right end, all digits are 0 (apparently this is how we find rightmost digit 1).

Then, if we do \texttt{n \& (n - 1)}, the effect is like we remove the rightmost digit 1:
\begin{verbatim}
eg. 1.
    1024: 0100 0000 0000
    1023: 0011 1111 1111
1024 AND 1023:
    xxxx: 0000 0000 0000
    1024: 0100 0000 0000
compared with 1024, we removed rightmost digit 1

eg. 2.
    44: 0010 1100
    43: 0010 1011
44 AND 43:
    xx: 0010 1000
    44: 0010 1100
compared with 44, we removed rightmost digit 1
\end{verbatim}

Once we know how to remove the rightmost digit 1 (\texttt{n \& (n - 1)}), the method to count the number of ones is straightforward:
\begin{minted}[breaklines=true,breakanywhere=true]{c}
int countOne(int n) {
  int count = 0;

  while (n) {
    n = n & (n - 1);
    count++;
  }

  return count;
}
\end{minted}
\subsubsection{Is power of four (practice \texttt{\&})}
\label{sec:orge6ebc82}
If a number is a power of four, it has only one digit 1, and this single 1 should be in any of the following positions occupied by one:
\begin{verbatim}
0101 0101 0101 0101 0101 0101 0101 0101

example, all following numbers are power of four:
0000 0000 0000 0000 0000 0000 0000 0001 (1)
0000 0000 0000 0000 0000 0000 0000 0100 (4)
0000 0000 0000 0000 0000 0000 0001 0000 (16)
0000 0000 0000 0000 0000 0001 0000 0000 (256)
\end{verbatim}
The number in hexadecimal form is: \texttt{0x55555555}.

For a given number \texttt{n}, we have to check if it has only one 1 in its binary form (otherwise, it cannot be the power of 4). Using knowledge from previous section, this can be simply \texttt{!(n \& (n - 1))}. The idea is straightforward, if we remove the rightmost digit 1 from the number, and the number becomes zero, it means there is only a single digit one in that number.

Then, we try to find out the location of this 1-bit.We do \texttt{n \& 0x55555555}. For example, take \texttt{n = 512}:
\begin{verbatim}
    0101 0101 0101 0101 0101 0101 0101 0101
AND 0000 0000 0000 0000 0000 0010 0000 0000
    0000 0000 0000 0000 0000 0000 0000 0000
\end{verbatim}
The 1-bit in 512 is not coincide with any 1-bit in \texttt{0x55555555}, so 512 is not a power of 4. The result of \texttt{AND} is zero (boolean value false).

Let's see \texttt{n = 4194304}:
\begin{verbatim}
    0101 0101 0101 0101 0101 0101 0101 0101
AND 0000 0000 0100 0000 0000 0000 0000 0000
    0000 0000 0100 0000 0000 0000 0000 0000
\end{verbatim}
This time, the 1-bit in 4194304 coincides with one 1-bit in \texttt{0x55555555}, so it is a power of 4. The result of \texttt{AND} is one (boolean value true).

Wrap up the solution, we have:
\begin{minted}[breaklines=true,breakanywhere=true]{c}
int isPowerOfFour(int n) {
  return !(n & (n - 1)) && (n & 0x55555555);
}
\end{minted}
\subsubsection{Add two numbers (practice \texttt{\textasciicircum{}, \&, <<})}
\label{sec:org9f7e76d}
Add two numbers without using \texttt{+, -, ++, -{}-}.
