Computer Science/Leetcode/Subjects/bit_manipulation/bit_manipulation.org
**** Recursion
(This method only works for two positive number).
--update: this method also works for negative numbers. Just declare the two integers as ~unsigned int~. Otherwise, leetcode will complain about left shift of a negative number

The function prototype is:
#+begin_src c++
int getSum(int a, int b);
#+end_src

Remember the exclusive OR (~^~) is equivalent to adding two bits and discard carry. Also, adding two numbers is essentially, adding each pairing bits. It may have carry or not. The situations are listed below (for a single bit addition):
#+BEGIN_EXAMPLE
No carry:
1    0    0
0    1    0
- or - or -
1    1    0

With carry:
 1
 1
 -
10
#+END_EXAMPLE
So, we can split the sum in two parts. Part 1 comes from adding two numbers without carry, which is simply ~a ^ b~. Part 2 comes from the possible carry from the addition. We can get this value by first ~a & b~ (this is give us 1-bit in both ~a~ and ~b~), then we left shift this number (because carry is essentially shifting 1 to next left bit). So the carry part is ~(a & b) << 1~. Now we have thise two parts, we can call ~getSum()~ again to calculate the sum for us.

The base case is when the carry part is zero. In this case we can simpliy return the other part. The code is as follows:
#+begin_src c++
int getSum(int a, int b) {
  if (b == 0)  // when the carry part is zero, a ^ b is a + b, so return the first part directly
    return a;

  return getSum(a ^ b, (a & b) << 1);
}
#+end_src
**** Add directly
[[https://stackoverflow.com/questions/700410/subtraction-without-minus-sign][Reference]]
This approach adds each bit in number ~a~ and number ~b~ to get the final result. To achieve this, we need following variables:
- ~loop~: an integer that record the position of current adding bit.
- ~sum~: an integer, keep the running total of summation
- ~ai~: an integer, keep the bit value of ~a~ at position specified by loop
- ~bi~: an integer, keep the bit value of ~b~ at position specified by loop
- ~ci~: an integer, keep the bit value of ~sum~ at position specified by loop

When traversing the number, we extract each bit-value of ~a~ and ~b~ and add them to ~sum~ (including carry, if there is any). We use following sequences to loop through all bits in an integer:
#+BEGIN_EXAMPLE
0000 0000 0000 0000 0000 0000 0000 0001
0000 0000 0000 0000 0000 0000 0000 0010
0000 0000 0000 0000 0000 0000 0000 0100
0000 0000 0000 0000 0000 0000 0000 1000
...
0010 0000 0000 0000 0000 0000 0000 0000
0100 0000 0000 0000 0000 0000 0000 0000
1000 0000 0000 0000 0000 0000 0000 0000
#+END_EXAMPLE
We can get this use a while loop and left shift:
#+begin_src c++
int loop = 1;
while (loop) {
  // ...
  loop = loop << 1;
  // ...
}
#+end_src

To extract the bit value where 1-bit in loop at, we simpliy:
#+begin_src c++
int loop = 1;
int sum = 0;
while (loop) {
  ai = a & loop;
  bi = b & loop;
  ci = sum & loop;
  
  loop = loop << 1;
}
#+end_src

Then, we first add the bit value in ~ai~ and ~bi~ to the same position in ~sum~, discarding carry right now:
#+begin_src c++
int loop = 1;
int sum = 0;
while (loop) {
  ai = a & loop;
  bi = b & loop;
  ci = sum & loop;
  sum = sum ^ ai ^ bi;
  loop = loop << 1;
}
#+end_src

Now we add carry. A carry should be added as long as any two of ~ai, bi, sum~ has a bit value of one. Also, only one carry is possible (you can draw a table listing all possible values of ~ai, bi, sum~ to verify this). Thus, the condition to add a carry is:
#+begin_src c++
(ai & bi) || (ci & ai) || (ci & bi)
#+end_src
To add a carry, we first move ~loop~ one bit left, then we do ~sum ^ loop~. This is because the bit at ~loop~'s current position (incremented) is 1 and the bit at ~sum~ is still 0, also, all other bits in ~sum~ will be kept (because all other bits in ~loop~ is 0). So we utilize the exclusive OR again:
#+begin_src c++
int loop = 1;
int sum = 0;
while (loop) {
  
  ai = a & loop;
  bi = b & loop;
  ci = sum & loop;
  
  sum = sum ^ ai ^ bi;
  loop = loop << 1;

  if ((ai & bi) || (ci & ai) || (ci & bi))
    sum = sum ^ loop;
}
#+end_src

Another thing worth noticing is, when ~loop~ reaches:
#+BEGIN_EXAMPLE
1000 0000 0000 0000 0000 0000 0000 0000
#+END_EXAMPLE
If we left shift it one more time, it becomes:
#+BEGIN_EXAMPLE
0000 0000 0000 0000 0000 0000 0000 0000
#+END_EXAMPLE
which is zero, then the while loop terminates. After the while loop terminates, we then return whatever inside ~sum~ as the summation result.

Interestingly, this method also works for adding numbers with different sign (negative numbers). But I don't know exactly why. I traced some examples, if the abs(negative) > abs(positive), then the leading 11111s (two-complements for negative number) will not disappear, following structure will kind of "regenerate" them:
#+BEGIN_EXAMPLE
0  this is 0 from positive operand
1  this is 1 from negative operand
0  this is carry (no carry)
-
1  results after adding carry, which is 1
#+END_EXAMPLE
the final result is negative.

if abs(negative) < abs(positive), all the leading 11111s will get eradicated one by one:
#+BEGIN_EXAMPLE
0  this is 0 from positive operand
1  this is 1 from negative operand
1  this is carry
-
0  results after adding carry, which is 0, carry goes to next bit
#+END_EXAMPLE
the final result is positive.

Code:
#+begin_src c++
  int getSum(int a, int b) {
    unsigned int ai;
    unsigned int bi;
    unsigned int ci;

    unsigned int sum = 0;
    unsigned int loop = 1;
    
    while (loop) {
      // extract current bit of a, b and sum
      ai = a & loop;
      bi = b & loop;
      ci = sum & loop;

      // add to sum, discard carry
      sum = sum ^ ai ^ bi;

      // move position
      loop = loop << 1;

      // add carry if there is any
      if ((ai & bi) || (ci & ai) || (ci & bi))
        sum = sum ^ loop;
    }

    return sum;    
  }
#+end_src
*** Missing number (practice ~^~)
Given an array containing n distinct numbers taken from 0, 1, ..., n, find the one that is missing from the array.

We'll use two properties of ~^~:
1. the XOR is its own inverse, which means ~num ^ num == 0~
2. any number XOR with zero is the number itself

From the problem we know that the range of index would be ~0~ to ~n - 1~, and possible value range is ~0~ to ~n~. Assume the array is sorted in ascending order (for illustration purpose, it still works for un-sorted array). We have two cases to consider: (1) the missing number is less than ~n~; (2) the missing number is ~n~;
