Computer Science/Leetcode/Subjects/bit_manipulation/bit_manipulation.tex
\paragraph{Recursion}
\label{sec:org1443688}
(This method only works for two positive number).
--update: this method also works for negative numbers. Just declare the two integers as \texttt{unsigned int}. Otherwise, leetcode will complain about left shift of a negative number

The function prototype is:
\begin{minted}[breaklines=true,breakanywhere=true]{c++}
int getSum(int a, int b);
\end{minted}

Remember the exclusive OR (\texttt{\textasciicircum{}}) is equivalent to adding two bits and discard carry. Also, adding two numbers is essentially, adding each pairing bits. It may have carry or not. The situations are listed below (for a single bit addition):
\begin{verbatim}
No carry:
1    0    0
0    1    0
- or - or -
1    1    0

With carry:
 1
 1
 -
10
\end{verbatim}
So, we can split the sum in two parts. Part 1 comes from adding two numbers without carry, which is simply \texttt{a \textasciicircum{} b}. Part 2 comes from the possible carry from the addition. We can get this value by first \texttt{a \& b} (this is give us 1-bit in both \texttt{a} and \texttt{b}), then we left shift this number (because carry is essentially shifting 1 to next left bit). So the carry part is \texttt{(a \& b) << 1}. Now we have thise two parts, we can call \texttt{getSum()} again to calculate the sum for us.

The base case is when the carry part is zero. In this case we can simpliy return the other part. The code is as follows:
\begin{minted}[breaklines=true,breakanywhere=true]{c++}
int getSum(int a, int b) {
  if (b == 0)  // when the carry part is zero, a ^ b is a + b, so return the first part directly
    return a;

  return getSum(a ^ b, (a & b) << 1);
}
\end{minted}
\paragraph{Add directly}
\label{sec:orge9beafd}
\href{https://stackoverflow.com/questions/700410/subtraction-without-minus-sign}{Reference}
This approach adds each bit in number \texttt{a} and number \texttt{b} to get the final result. To achieve this, we need following variables:
\begin{itemize}
\item \texttt{loop}: an integer that record the position of current adding bit.
\item \texttt{sum}: an integer, keep the running total of summation
\item \texttt{ai}: an integer, keep the bit value of \texttt{a} at position specified by loop
\item \texttt{bi}: an integer, keep the bit value of \texttt{b} at position specified by loop
\item \texttt{ci}: an integer, keep the bit value of \texttt{sum} at position specified by loop
\end{itemize}

When traversing the number, we extract each bit-value of \texttt{a} and \texttt{b} and add them to \texttt{sum} (including carry, if there is any). We use following sequences to loop through all bits in an integer:
\begin{verbatim}
0000 0000 0000 0000 0000 0000 0000 0001
0000 0000 0000 0000 0000 0000 0000 0010
0000 0000 0000 0000 0000 0000 0000 0100
0000 0000 0000 0000 0000 0000 0000 1000
...
0010 0000 0000 0000 0000 0000 0000 0000
0100 0000 0000 0000 0000 0000 0000 0000
1000 0000 0000 0000 0000 0000 0000 0000
\end{verbatim}
We can get this use a while loop and left shift:
\begin{minted}[breaklines=true,breakanywhere=true]{c++}
int loop = 1;
while (loop) {
  // ...
  loop = loop << 1;
  // ...
}
\end{minted}

To extract the bit value where 1-bit in loop at, we simpliy:
\begin{minted}[breaklines=true,breakanywhere=true]{c++}
int loop = 1;
int sum = 0;
while (loop) {
  ai = a & loop;
  bi = b & loop;
  ci = sum & loop;

  loop = loop << 1;
}
\end{minted}

Then, we first add the bit value in \texttt{ai} and \texttt{bi} to the same position in \texttt{sum}, discarding carry right now:
\begin{minted}[breaklines=true,breakanywhere=true]{c++}
int loop = 1;
int sum = 0;
while (loop) {
  ai = a & loop;
  bi = b & loop;
  ci = sum & loop;
  sum = sum ^ ai ^ bi;
  loop = loop << 1;
}
\end{minted}

Now we add carry. A carry should be added as long as any two of \texttt{ai, bi, sum} has a bit value of one. Also, only one carry is possible (you can draw a table listing all possible values of \texttt{ai, bi, sum} to verify this). Thus, the condition to add a carry is:
\begin{minted}[breaklines=true,breakanywhere=true]{c++}
(ai & bi) || (ci & ai) || (ci & bi)
\end{minted}
To add a carry, we first move \texttt{loop} one bit left, then we do \texttt{sum \textasciicircum{} loop}. This is because the bit at \texttt{loop}'s current position (incremented) is 1 and the bit at \texttt{sum} is still 0, also, all other bits in \texttt{sum} will be kept (because all other bits in \texttt{loop} is 0). So we utilize the exclusive OR again:
\begin{minted}[breaklines=true,breakanywhere=true]{c++}
int loop = 1;
int sum = 0;
while (loop) {

  ai = a & loop;
  bi = b & loop;
  ci = sum & loop;

  sum = sum ^ ai ^ bi;
  loop = loop << 1;

  if ((ai & bi) || (ci & ai) || (ci & bi))
    sum = sum ^ loop;
}
\end{minted}

Another thing worth noticing is, when \texttt{loop} reaches:
\begin{verbatim}
1000 0000 0000 0000 0000 0000 0000 0000
\end{verbatim}
If we left shift it one more time, it becomes:
\begin{verbatim}
0000 0000 0000 0000 0000 0000 0000 0000
\end{verbatim}
which is zero, then the while loop terminates. After the while loop terminates, we then return whatever inside \texttt{sum} as the summation result.

Interestingly, this method also works for adding numbers with different sign (negative numbers). But I don't know exactly why. I traced some examples, if the abs(negative) > abs(positive), then the leading 11111s (two-complements for negative number) will not disappear, following structure will kind of "regenerate" them:
\begin{verbatim}
0  this is 0 from positive operand
1  this is 1 from negative operand
0  this is carry (no carry)
-
1  results after adding carry, which is 1
\end{verbatim}
the final result is negative.

if abs(negative) < abs(positive), all the leading 11111s will get eradicated one by one:
\begin{verbatim}
0  this is 0 from positive operand
1  this is 1 from negative operand
1  this is carry
-
0  results after adding carry, which is 0, carry goes to next bit
\end{verbatim}
the final result is positive.

Code:
\begin{minted}[breaklines=true,breakanywhere=true]{c++}
int getSum(int a, int b) {
  unsigned int ai;
  unsigned int bi;
  unsigned int ci;

  unsigned int sum = 0;
  unsigned int loop = 1;

  while (loop) {
    // extract current bit of a, b and sum
    ai = a & loop;
    bi = b & loop;
    ci = sum & loop;

    // add to sum, discard carry
    sum = sum ^ ai ^ bi;

    // move position
    loop = loop << 1;

    // add carry if there is any
    if ((ai & bi) || (ci & ai) || (ci & bi))
      sum = sum ^ loop;
  }

  return sum;    
}
\end{minted}
\subsubsection{Missing number (practice \texttt{\textasciicircum{}})}
\label{sec:orgca5bd71}
Given an array containing n distinct numbers taken from 0, 1, \ldots{}, n, find the one that is missing from the array.

We'll use two properties of \texttt{\textasciicircum{}}:
\begin{enumerate}
\item the XOR is its own inverse, which means \texttt{num \textasciicircum{} num == 0}
\item any number XOR with zero is the number itself
\end{enumerate}

From the problem we know that the range of index would be \texttt{0} to \texttt{n - 1}, and possible value range is \texttt{0} to \texttt{n}. Assume the array is sorted in ascending order (for illustration purpose, it still works for un-sorted array). We have two cases to consider: (1) the missing number is less than \texttt{n}; (2) the missing number is \texttt{n};
