Computer Science/Leetcode/Subjects/bit_manipulation/bit_manipulation.org
**** Case 1: missing number is less than n
Assume the missing number in array is ~k~. We traverse the array from index ~0~ to ~n - 1~. We use ~0~ to XOR all index and all ~nums[index]~, we'll get:
#+BEGIN_EXAMPLE
0^0^0^1^1^...^(k-1)^(k-1)^k^(k+1)^...^(n-1)^n
#+END_EXAMPLE
add parenthese to make it clearer:
#+BEGIN_EXAMPLE
0 ^ (0^0) ^ (1^1) ^...^ ((k-1)^(k-1)) ^ (k^(k+1)) ^...^ ((n-1)^n)
#+END_EXAMPLE
The first zero is what we use to XOR all index and ~nums[index]~. The first term in parenthese is index, which ranges from ~0~ to ~n - 1~. The second term is ~nums[index]~. We XOR them one by one. Notice that when index is ~k~, ~nums[k]~ is ~k + 1~, because ~k~ is missing in ~nums~. It is clear that if the array is unsorted, we can still get this structure by rearranging terms, since XOR is associative. Now, rearranging same terms together:
#+BEGIN_EXAMPLE
0 ^ (0^0) ^ (1^1) ^...^ ((k-1)^(k-1)) ^ ((k+1)^(k+1)) ^...^ ((n-1)^(n-1)) ^ n ^ k
#+END_EXAMPLE
~k~ is put to the end.

Now, use ~^~'s self-inverse property, we cancel out ~(i^i)~ terms:
#+BEGIN_EXAMPLE
0 ^ n ^ k
#+END_EXAMPLE
to find out the missing ~k~, we just need to XOR this with the size ~n~:
#+BEGIN_EXAMPLE
0 ^ n ^ n ^ k = 0 ^ k = k
#+END_EXAMPLE
**** Case 2: missing number is n
Using same technique, we use ~0~ to XOR all index and all ~nums[index]~, we'll get:
#+BEGIN_EXAMPLE
0^0^0^1^1^...^(n-1)^(n-1)
#+END_EXAMPLE
Cancel out all ~(i^i)~ terms, we have ~0~ left. Then if we XOR it with the size ~n~, we still get the missing number (in this case, ~n~). So, for both cases, we can use the same technique to solve it.
**** Solution
Get the result of ~0~ XOR each index (from ~0~ to ~n - 1~) and each number (~nums[i]~), then XOR the result with the size of the array ~nums.size()~.

The code is as follows:
#+begin_src c++
int missingNumber(vector<int>& nums) {
  int ret = nums.size();
  
  for (int i = 0; i < nums.size(); i++) {
    ret ^= i;
    ret ^= nums[i];
  }
  
  return ret;
}

#+end_src
*** Largest power of 2 (practice ~|~)
Given a number ~num~, find the largest power of 2 (the most significant bit in binary form) which is less than or equal to ~num~.
**** Solution 1: remove right 1-bit until only one left
This method uses the same technique as counting 1-bit. We remove the rightmost 1-bit until only a single 1-bit left:
#+begin_src c
long largest_power(long N) {
  int temp;

  while (temp = N & (N - 1))
    N = temp;

  return N;
}
#+end_src
**** Solution 2: use ~|~
The ~|~ operator will keep as many 1-bits as possible. Here, the thought is first changing all right side bits to 1, then we add 1 to the number and perform a right shift.
#+begin_src c++
long largest_power(long N) {
    //changing all right side bits to 1.
    N = N | (N>>1);
    N = N | (N>>2);
    N = N | (N>>4);
    N = N | (N>>8);
    N = N | (N>>16);
    return (N+1)>>1;
}
#+end_src
*** Reverse bits (practice ~|~)
Given an unsigned integer (32 bits), reverse the order of the bits.
**** Extract each bit and store the bit in another number
We traverse the number, extract the value on each bit in order, then we store this bit-information in another number (for example, we can use a zero integer to hold the result) in reverse order.

To traverse the whole number, we use a loop number, or mask, which is 1 initially, and left shift one bit at each iteration.

The code is as follows:
#+begin_src c++
uint32_t reverseBits(uint32_t n) {
  uint32_t ret = 0;  // to hold result
  uint32_t pos = 1;  // to loop over the num, mask

  for (int i = 31; i >= 0; i--, pos <<= 1)
    ret |= ((n & pos) == 0) ? 0 : 1 << i;  // (n & pos) should be in parenthese

  return ret;
}
#+end_src
~(n & pos)~ should be in parenthese, otherwise ~pos == 0~ will be evaluated first, then the truth value will be used to calculate ~n & bool~.
**** Solution 2: right shift input number repeatedly and collect rightmost bit
The rightmost bit in ~n~ can be extracted easily by ~n & 1~. To get the rightmost bit of ~n~ one by one, we can simpliy right shift it after we get the current rightmost bit. We store the information of extraced bit value in reverse order, i.e. from leftmost bit to rightmost bit, to a container initially set as zero (~ret~). Thus, the mask will be ~1 << 31~ this time (because the mask is used to record bit, not to extract value, when the current rightmost bit in ~n~ is 1, we do ~ret |= mask~ to record this 1-bit in the corresponding position in ~ret~).

The code is as follows:
#+begin_src c++
uint32_t reverseBits(unit32_t n) {
  unsigned int mask = 1 << 31, ret = 0;

  for (int i = 0; i < 32; ++i) {
    if (n & 1)
      ret |= mask;
    mask >>= 1;
    n >>= 1;
  }

  return ret;
}
#+end_src
**** Solution 3: write bit at rightmost bit and left shift result
In this approach, after we detect the bit value in input number, we set the bit at rightmost of our container as the result, then we perform a left shift to "push" the result to left. Repeat this until we extract all bits from the input number. Notice that we don't do left shift when the last bit is set (since it is the last one). In practice you can left shift ~ret~ first and then set value at the rightmost bit.

Code:
#+begin_src c++
uint32_t reverseBits(unit32_t n) {
  unsigned int ret = 0;

  for (int i = 0; i < 32; ++i, n >>= 1) {
    ret <<= 1;
    ret |= n & 1;
  }

  return ret;
}
#+end_src
*** ~&~ tricks
The ~&~ operator can be used to select bits on certain position. Some numbers with special binary pattern are listed below (with their hexadecimal value, which is easier to remember):
|     <c>      |                    <c>                    |
|     Hex      |                    Bin                    |
|--------------+-------------------------------------------|
| ~0xaaaaaaaa~ | ~1010 1010 1010 1010 1010 1010 1010 1010~ |
| ~0x55555555~ | ~0101 0101 0101 0101 0101 0101 0101 0101~ |
| ~0xcccccccc~ | ~1100 1100 1100 1100 1100 1100 1100 1100~ |
| ~0x33333333~ | ~0011 0011 0011 0011 0011 0011 0011 0011~ |
| ~0xf0f0f0f0~ | ~1111 0000 1111 0000 1111 0000 1111 0000~ |
| ~0x0f0f0f0f~ | ~0000 1111 0000 1111 0000 1111 0000 1111~ |
| ~0xff00ff00~ | ~1111 1111 0000 0000 1111 1111 0000 0000~ |
| ~0x00ff00ff~ | ~0000 0000 1111 1111 0000 0000 1111 1111~ |
| ~0xffff0000~ | ~1111 1111 1111 1111 0000 0000 0000 0000~ |
| ~0x0000ffff~ | ~0000 0000 0000 0000 1111 1111 1111 1111~ |

If a number ~&~ with the above special number, only bits coincide with the pattern's bits will be kept.

