Computer Science/Leetcode/Subjects/bit_manipulation/bit_manipulation.tex
\paragraph{Case 1: missing number is less than n}
\label{sec:orgd3e9ab2}
Assume the missing number in array is \texttt{k}. We traverse the array from index \texttt{0} to \texttt{n - 1}. We use \texttt{0} to XOR all index and all \texttt{nums[index]}, we'll get:
\begin{verbatim}
0^0^0^1^1^...^(k-1)^(k-1)^k^(k+1)^...^(n-1)^n
\end{verbatim}
add parenthese to make it clearer:
\begin{verbatim}
0 ^ (0^0) ^ (1^1) ^...^ ((k-1)^(k-1)) ^ (k^(k+1)) ^...^ ((n-1)^n)
\end{verbatim}
The first zero is what we use to XOR all index and \texttt{nums[index]}. The first term in parenthese is index, which ranges from \texttt{0} to \texttt{n - 1}. The second term is \texttt{nums[index]}. We XOR them one by one. Notice that when index is \texttt{k}, \texttt{nums[k]} is \texttt{k + 1}, because \texttt{k} is missing in \texttt{nums}. It is clear that if the array is unsorted, we can still get this structure by rearranging terms, since XOR is associative. Now, rearranging same terms together:
\begin{verbatim}
0 ^ (0^0) ^ (1^1) ^...^ ((k-1)^(k-1)) ^ ((k+1)^(k+1)) ^...^ ((n-1)^(n-1)) ^ n ^ k
\end{verbatim}
\texttt{k} is put to the end.

Now, use \texttt{\textasciicircum{}}'s self-inverse property, we cancel out \texttt{(i\textasciicircum{}i)} terms:
\begin{verbatim}
0 ^ n ^ k
\end{verbatim}
to find out the missing \texttt{k}, we just need to XOR this with the size \texttt{n}:
\begin{verbatim}
0 ^ n ^ n ^ k = 0 ^ k = k
\end{verbatim}
\paragraph{Case 2: missing number is n}
\label{sec:orgd77dc42}
Using same technique, we use \texttt{0} to XOR all index and all \texttt{nums[index]}, we'll get:
\begin{verbatim}
0^0^0^1^1^...^(n-1)^(n-1)
\end{verbatim}
Cancel out all \texttt{(i\textasciicircum{}i)} terms, we have \texttt{0} left. Then if we XOR it with the size \texttt{n}, we still get the missing number (in this case, \texttt{n}). So, for both cases, we can use the same technique to solve it.
\paragraph{Solution}
\label{sec:org24f3658}
Get the result of \texttt{0} XOR each index (from \texttt{0} to \texttt{n - 1}) and each number (\texttt{nums[i]}), then XOR the result with the size of the array \texttt{nums.size()}.

The code is as follows:
\begin{minted}[breaklines=true,breakanywhere=true]{c++}
int missingNumber(vector<int>& nums) {
  int ret = nums.size();

  for (int i = 0; i < nums.size(); i++) {
    ret ^= i;
    ret ^= nums[i];
  }

  return ret;
}

\end{minted}
\subsubsection{Largest power of 2 (practice \texttt{|})}
\label{sec:org64cc3fc}
Given a number \texttt{num}, find the largest power of 2 (the most significant bit in binary form) which is less than or equal to \texttt{num}.
\paragraph{Solution 1: remove right 1-bit until only one left}
\label{sec:orga54da3a}
This method uses the same technique as counting 1-bit. We remove the rightmost 1-bit until only a single 1-bit left:
\begin{minted}[breaklines=true,breakanywhere=true]{c}
long largest_power(long N) {
  int temp;

  while (temp = N & (N - 1))
    N = temp;

  return N;
}
\end{minted}
\paragraph{Solution 2: use \texttt{|}}
\label{sec:org4b881fa}
The \texttt{|} operator will keep as many 1-bits as possible. Here, the thought is first changing all right side bits to 1, then we add 1 to the number and perform a right shift.
\begin{minted}[breaklines=true,breakanywhere=true]{c++}
long largest_power(long N) {
    //changing all right side bits to 1.
    N = N | (N>>1);
    N = N | (N>>2);
    N = N | (N>>4);
    N = N | (N>>8);
    N = N | (N>>16);
    return (N+1)>>1;
}
\end{minted}
\subsubsection{Reverse bits (practice \texttt{|})}
\label{sec:org82bd2d3}
Given an unsigned integer (32 bits), reverse the order of the bits.
\paragraph{Extract each bit and store the bit in another number}
\label{sec:orgc416428}
We traverse the number, extract the value on each bit in order, then we store this bit-information in another number (for example, we can use a zero integer to hold the result) in reverse order.

To traverse the whole number, we use a loop number, or mask, which is 1 initially, and left shift one bit at each iteration.

The code is as follows:
\begin{minted}[breaklines=true,breakanywhere=true]{c++}
uint32_t reverseBits(uint32_t n) {
  uint32_t ret = 0;  // to hold result
  uint32_t pos = 1;  // to loop over the num, mask

  for (int i = 31; i >= 0; i--, pos <<= 1)
    ret |= ((n & pos) == 0) ? 0 : 1 << i;  // (n & pos) should be in parenthese

  return ret;
}
\end{minted}
\texttt{(n \& pos)} should be in parenthese, otherwise \texttt{pos == 0} will be evaluated first, then the truth value will be used to calculate \texttt{n \& bool}.
\paragraph{Solution 2: right shift input number repeatedly and collect rightmost bit}
\label{sec:orgd1a42d5}
The rightmost bit in \texttt{n} can be extracted easily by \texttt{n \& 1}. To get the rightmost bit of \texttt{n} one by one, we can simpliy right shift it after we get the current rightmost bit. We store the information of extraced bit value in reverse order, i.e. from leftmost bit to rightmost bit, to a container initially set as zero (\texttt{ret}). Thus, the mask will be \texttt{1 << 31} this time (because the mask is used to record bit, not to extract value, when the current rightmost bit in \texttt{n} is 1, we do \texttt{ret |= mask} to record this 1-bit in the corresponding position in \texttt{ret}).

The code is as follows:
\begin{minted}[breaklines=true,breakanywhere=true]{c++}
uint32_t reverseBits(unit32_t n) {
  unsigned int mask = 1 << 31, ret = 0;

  for (int i = 0; i < 32; ++i) {
    if (n & 1)
      ret |= mask;
    mask >>= 1;
    n >>= 1;
  }

  return ret;
}
\end{minted}
\paragraph{Solution 3: write bit at rightmost bit and left shift result}
\label{sec:org137c318}
In this approach, after we detect the bit value in input number, we set the bit at rightmost of our container as the result, then we perform a left shift to "push" the result to left. Repeat this until we extract all bits from the input number. Notice that we don't do left shift when the last bit is set (since it is the last one). In practice you can left shift \texttt{ret} first and then set value at the rightmost bit.

Code:
\begin{minted}[breaklines=true,breakanywhere=true]{c++}
uint32_t reverseBits(unit32_t n) {
  unsigned int ret = 0;

  for (int i = 0; i < 32; ++i, n >>= 1) {
    ret <<= 1;
    ret |= n & 1;
  }

  return ret;
}
\end{minted}
\subsubsection{\texttt{\&} tricks}
\label{sec:orgf56e4c4}
The \texttt{\&} operator can be used to select bits on certain position. Some numbers with special binary pattern are listed below (with their hexadecimal value, which is easier to remember):
\begin{center}
\begin{tabular}{cc}
Hex & Bin\\
\hline
\texttt{0xaaaaaaaa} & \texttt{1010 1010 1010 1010 1010 1010 1010 1010}\\
\texttt{0x55555555} & \texttt{0101 0101 0101 0101 0101 0101 0101 0101}\\
\texttt{0xcccccccc} & \texttt{1100 1100 1100 1100 1100 1100 1100 1100}\\
\texttt{0x33333333} & \texttt{0011 0011 0011 0011 0011 0011 0011 0011}\\
\texttt{0xf0f0f0f0} & \texttt{1111 0000 1111 0000 1111 0000 1111 0000}\\
\texttt{0x0f0f0f0f} & \texttt{0000 1111 0000 1111 0000 1111 0000 1111}\\
\texttt{0xff00ff00} & \texttt{1111 1111 0000 0000 1111 1111 0000 0000}\\
\texttt{0x00ff00ff} & \texttt{0000 0000 1111 1111 0000 0000 1111 1111}\\
\texttt{0xffff0000} & \texttt{1111 1111 1111 1111 0000 0000 0000 0000}\\
\texttt{0x0000ffff} & \texttt{0000 0000 0000 0000 1111 1111 1111 1111}\\
\end{tabular}
\end{center}

If a number \texttt{\&} with the above special number, only bits coincide with the pattern's bits will be kept.
