Computer Science/Leetcode/Subjects/bit_manipulation/bit_manipulation.org
*** Bitwise AND of Numbers Range
Given a range ~[m, n]~ where ~0 <= m <= n <= 2147483647~, return the bitwise AND of all numbers in this range, inclusive. For example, given the range ~[5, 7]~, you should return ~4~.

The naive solution is:
#+begin_src c++
  int rangeBitwiseAnd(int m, int n) {
    int ret = ~0;
    
    for (int i = m; i <= n; i++)
      ret &= i;
    
    return ret;
  }
#+end_src
however the problem requires a faster algorithm.

Let's see an example, ~m = 25~, ~n = 29~:
#+BEGIN_EXAMPLE
25: 11001
26: 11010
27: 11011
28: 11100
29: 11101
#+END_EXAMPLE
When performing bitwise AND among all the numbers in the range, if any bit is 0, then the final result would be zero.

When number changes, the bit-value changes, it may be 0 or 1. We first find out what doesn't change from ~m~ to ~n~:
#+BEGIN_EXAMPLE
25: 11...
26: 11...
27: 11...
28: 11...
29: 11...
#+END_EXAMPLE
The left two bits remain unchanged for all numbers in the range, so for these two bits:
#+BEGIN_EXAMPLE
25 & 26 & 27 & 28 & 29 == 25 & 29
#+END_EXAMPLE
For all the rest three bits, no bit can remain a constant 1 or 0 in the range (otherwise, it would be categorized as unchanged bit also). So the bitwise AND is zero (at least one zero would be in any bit position). Thus, the result of bitwise AND to all numbers in the range ~[25, 29]~ is ~11000~.

So the solution is straightforward, first we keep right shifting until ~m == n~, we count how many bits we shifted during the process. Then, we left shift back the same number of bits.

Code:
#+begin_src c++
class Solution {
public:
  int rangeBitwiseAnd(int m, int n) {
    int a = 0;
    
    while (m != n) {
      m >>= 1;
      n >>= 1;
      a++;
    }
    return n << a;
  }
};
#+end_src

*** Repeated DNA sequences
This example will show how to create integer hash key for certain objects (of those related to integer type, like ~char~ or ~string~) using bit manipulation.

The problem statement can be found [[https://leetcode.com/problems/repeated-dna-sequences/][here]]. One naive solution is to traverse the string, for each 10-char sequence, we store it in a hash table (~unordered_map<string, int>~). The value of the hash table is the appearing times of the char sequence. Then, we traverse the hash table, push each string (the key) to the result vector if the appearing time is more than 1.

Here we use another approach. We write the hash rule to map a 10-char long string to an integer. The 10-char string can only pick four possible characters: ~A, T, G, C~. So for a character in the string, there are four states. To describe four states, we need 2 bits (00, 01, 10, 11). We define a map rule that translates ~A, T, G, C~ to four numbers ~00, 01, 10, 11~:
#+begin_src c++
  int chtonum(char ch) {
    switch (ch) {
    case 'A':
      return 0;
    case 'T':
      return 1;
    case 'G':
      return 2;
    case 'C':
      return 3;
    default:
      return -1;
    }
  }
#+end_src

As an example, following is the process to encode ~s = "ATCG"~:
#+begin_src c++
int key = 0;
for (int i = 0; i < 4; i++) {
  key = (key << 2) | chtonum(s[i]);
}

"A": 00
"AT": 00 01
"ATC": 00 01 11
"ATCG": 00 01 11 10 
#+end_src

When the length of key reaches 20-bit (which means it encoded 10 chars), the next char can make it longer than 20-bit, to keep the length of key to 20-bit, we can use a mask:
#+begin_src c++
int mask = 0xfffff;  // mask: 1111 1111 1111 1111 1111
#+end_src
so, after we update the ~key~, we perform a bitwise AND with the mask, to keep the length of key as 20-bit:
#+begin_src c++
key = ((key << 2) | chtonum(s[i])) & mask;
#+end_src

Now, we encoded the 10-char string (use a 20-bit integer to represent a unique combination of 10-char sequence). There are a total of \(4^10\) combinations of these sequences, so the number of potential keys is also \(4^10\). We can use an array to record each key's frequency, so we need to create an array big enough to hold all of it. The index is the possible key value.
#+begin_src c++
int key_count[1 << 20] {0};
#+end_src

Each time we obtained a newly generated key, we check the value of key_count[key]. If it is 1, it means it already appeared before, we find out the 10-char string and push it to result vector. If it is other value (0 or > 1), it means it is either not appeared before, or appeared more than once (we have already pushed it in result vector, so we don't push it again). To find out the 10-char, just notice that the current char is the last char of this 10-char string, so the string is ~s.substr(i - 9, 10)~.

Code:
#+begin_src c++
class Solution {
public:
  // mapping from ch to integer number
  int chtonum(char ch) {
    switch (ch) {
    case 'A':
      return 0;
    case 'T':
      return 1;
    case 'G':
      return 2;
    case 'C':
      return 3;
    default:
      return -1;
    }
  }
  
  vector<string> findRepeatedDnaSequences(string s) {
    int length = s.size();
    
    if (length < 11)
      return {};
    
    int key = 0;  // used to store hash key for the 10-char string
    
    int mask = 0xfffff;
    vector<string> v;
    
    int key_count[1 << 20] {0};  
    
    // calculate the key for the first 9 characters
    for (int i = 0; i < 9; i++)
      key = (key << 2) | chtonum(s[i]);
    // find the possible sequences in rest of the string
    for (int i = 9; i < length; i++) {
      key = ((key << 2) | chtonum(s[i])) & mask;
      key_count[key]++;
      if (key_count[key] == 2) {
        v.push_back(s.substr(i - 9, 10));
      }
    }
    
    // return the result vector
    return v;       
  }
};
#+end_src
*** Majority Element
The problem statement can be found [[https://leetcode.com/problems/majority-element/][here]]. Other solutions possible (check my leetcode notes). Here we use bit manipulation to solve it.

Take array ~[5,5,4,5,1,5,6,5]~ as an example. the binary format of those numbers are listed below:
#+BEGIN_EXAMPLE
5: 0101
5: 0101
4: 0100
5: 0101
1: 0001
5: 0101
6: 0110
5: 0101
#+END_EXAMPLE
Since the majority element is the one that appears more than ~n / 2~ times, the bit value of the majority element should also be "majority bit value". So we just need to find out the majority bit value at each bit, and reconstruct the majority element using this information. In the above example, the majority bit value for each bit (from left to right) i
s: ~0, 1, 0, 1~, thus the majority element is ~0101~, which is 5.

Code:
#+begin_src c++
class Solution {
public:
  int majorityElement(vector<int>& nums) {
    int length = 8 * sizeof(int);
    int size = nums.size();
    int count = 0;
    unsigned int mask = 1;
    int ret = 0;
    
    for (int i = 0; i < length; i++) {  // traverse over each bit 
      count = 0;  // count number of 1-bit at current bit (for all number in nums)
      for (int j = 0; j < size; j++)
        if (mask & nums[j])
          count++;
      if (count > size / 2)  // if number of 1-bit is greater than size / 2, it is the majority bit, update directly (better than my solution). You only consider 1-bit case, because ret is 0-bit by default
        ret |= mask;
      
      mask <<= 1;
    }
    
    return ret;
  }
};
#+end_src
*** Single number II
The problem statement can be found [[https://leetcode.com/problems/single-number-ii/][here]].
