Computer Science/Leetcode/Subjects/bit_manipulation/bit_manipulation.tex
\subsubsection{Single number II}
\label{sec:org19ee27e}
The problem statement can be found \href{https://leetcode.com/problems/single-number-ii/}{here}.
\paragraph{Bit counting}
\label{sec:org3b30f2c}
For each bit position, count the number of 1-bit on the position. If the single number has a 0-bit here, the total bit\_count should mod 3 (because other numbers appear exactly three times). If the single number has a 1-bit here, \texttt{bit\_count \% 3 != 0}. We can use this to determine bit value of the single number at each bit and reconstruct it during the process.

Code:
\begin{minted}[breaklines=true,breakanywhere=true]{c++}
class Solution {
public:
  int singleNumber(vector<int>& nums) {
    int length = 8 * sizeof(int);
    int ret = 0;
    unsigned int mask = 1;
    int bit_count;

    // for each bit, calculate bit_count for all numbers
    for (int i = 0; i < length; i++) {
      bit_count = 0;

      for (int num : nums)
	if (num & mask)
	  bit_count++;

      if (bit_count % 3)
	ret |= mask;

      mask <<= 1;
    }

    return ret;
  }
};
\end{minted}
\paragraph{Logical circuit design}
\label{sec:org802fafd}
Not quite understand. Put it to future work.
\paragraph{Check other solutions on the website.}
\label{sec:orgc93d594}

\subsubsection{Single number III}
\label{sec:orgeec16d8}
The problem statement can be found \href{https://leetcode.com/problems/single-number-iii/}{here}.

You are given an array of numbers nums, in which exactly two elements appear only once and all the other elements appear exactly twice. Find the two elements that appear only once.

Example:
\begin{verbatim}
input: [1,2,1,3,2,5]
Output: [3,5]
\end{verbatim}

To cancel number that appeared twice, we can think of using exclusive or, because \texttt{a \textasciicircum{} a == 0}. Assume the two single number is \texttt{a} and \texttt{b}. We traverse the array first to use \texttt{0} to XOR each number, we'll get \texttt{a \textasciicircum{} b}.

How to find out \texttt{a} and \texttt{b} using \texttt{a \textasciicircum{} b}? By taking a look at the bits in \texttt{a \textasciicircum{} b}, we found that any 1-bit in this number suggests \texttt{a} and \texttt{b} has different bit-value at this bit-position. By using this information, we can divide the array into two groups: all numbers has a 1-bit at certain bit position (of those 1-bit position in \texttt{a \textasciicircum{} b}) goes to group A, all number has a 0-bit at the same bit-position goes to group B. So the two single numbers are separated in group A and group B. If we do another xor for each number in two groups, we can get the individual value of \texttt{a} and \texttt{b}.

There is not need to use extra space to store two groups, we xor each number when it is grouped.

This solution was provided by \href{https://leetcode.com/problems/single-number-iii/discuss/68998/How-to-use-bit-manipulation-to-solve-this-problem}{this} reference.
Code:
\begin{minted}[breaklines=true,breakanywhere=true]{c++}
vector<int> singleNumber(vector<int>& nums) {
  int mask;
  int axorb = 0;
  int a = 0;
  int b = 0;

  // get a ^ b
  for (int num : nums)
    axorb ^= num;

  // find out different bit in a and b
  mask = axorb ^ (axorb & (axorb - 1));

  // go over array again and axorb two groups
  for (int num : nums) {
    if (num & mask)
      a ^= num;
    else 
      b ^= num;
  }

  return {a, b};
}

\end{minted}

\subsubsection{Maximum product of word lengths}
\label{sec:orgf748601}
The problem statement can be found \href{https://leetcode.com/problems/maximum-product-of-word-lengths/}{here}.

The tricky part is how to determine two words intersect or not.

If using brutal force, for two words \texttt{A} and \texttt{B}, we start with the first letter in \texttt{A}, traverse \texttt{B} to find out if \texttt{B} contains the letter or not. Then, we do the same thing for the second letter in \texttt{A}. Assume the average length of each word is \texttt{k}. We need \texttt{k\textasciicircum{}2} comparisons just to determine if \texttt{A} and \texttt{B} intersects or not. And we must do this for any pair of two words (which is Cn2). We need to find a way that can determine whether two words intersects or not faster.

Bitwise AND operator is a fast way to perform intersection on two numbers (two sets). For a word and its letters, you may want to design a method to transform a word into an integer, the bit-value in this integer should carry information of which letter appeared in the original word. When we intersect two such integers, the result can show us wether the two words that behind this two integers have common letters or not.

Notice that there is no limit to the word length. Also, if a character repeats itself in a word, our encoded integer should encode just one character (because this is enough).

At first, I was thinking to encode each letter to a series of bit. There are 26 letters, so there are 26 states, I need a minimum of 5 bits to describe them all (because \texttt{2\textasciicircum{}5} > 26). But an integer only has 32 bits, which means if using this method, I can only encode a word with length less than 6 letters (record which word appeared in this word). How to encode a word to an integer?

In fact, you don't have to use 5-bit to record a single character's appearance. The integer type has a natural structure which we can use to map to 26 letters. That is the bit position. An integer has 32 bits, we can use the first 26 bits to indicate 26 letters. For example:
\begin{verbatim}
zyxwvutsrqponmlkjihgfedcba
00000000000000000000000000
\end{verbatim}
The bit value at each bit can be either 1 or 0, we use this to indicate whether the corresponding letter appeared or not. For example, to encode \texttt{"abce"}, we have:
\begin{verbatim}
zyxwvutsrqponmlkjihgfedcba
00000000000000000000010111
\end{verbatim}

So, the steps are:
\begin{enumerate}
\item transform the word list to an integer list, which contains info of letter appearing frequency
\item traverse this integer array, for each word, check if there is any word after intersects with it. If so, calculate product of word length and update the running maximum product. No need to check backward because they are already checked in previous run of the loop.
\end{enumerate}

Some trival details that can enhance your code:
\begin{enumerate}
\item use an array to store the length of words. So no need to call .length() frequently
\item use max() function to determine which one is larger.
\end{enumerate}


\subsection{place holder}
\label{sec:org38651da}
\end{document}
